<?php
//exassignment_operator_030.php
$a=5; $b=12;
$c=$a+$b;
$c+=$a;
echo "ตัวแปร a เท่ากับ ",$a,"<br>ตัวแปร b เท่ากับ ",$b," <br>ตัวแปร c เท่ากับ ",$c;
$c-=$a;
echo "<hr>";
echo "ตัวแปร a เท่ากับ ",$a,"<br>ตัวแปร b เท่ากับ ",$b," <br>ตัวแปร c เท่ากับ ",$c;
$b*=$b;
echo "<hr>";
echo "ตัวแปร a เท่ากับ ",$a,"<br>ตัวแปร b เท่ากับ ",$b," <br>ตัวแปร c เท่ากับ ",$c;
$a/=$c;
echo "<hr>";
echo "ตัวแปร a เท่ากับ ",$a,"<br>ตัวแปร b เท่ากับ ",$b," <br>ตัวแปร c เท่ากับ ",$c;
$b%=$c;
echo "<hr>";
echo "ตัวแปร a เท่ากับ ",$a,"<br>ตัวแปร b เท่ากับ ",$b," <br>ตัวแปร c เท่ากับ ",$c;
?>